# Seleções

In [2]:
import pandas as pd

In [7]:
data = [(1,2,3,4),(5,6,7,8),(9,10,11,12),(13,14,15,16)]

### Definindo linhas e colunas com função split

In [8]:
df = pd.DataFrame(data, 'l1 l2 l3 l4'.split(), 'c1 c2 c3 c4'.split() )
df

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8
l3   9  10  11  12
l4  13  14  15  16

### Selecionando duas colunas

In [13]:
df[['c1' , 'c3']]

    c1  c3
l1   1   3
l2   5   7
l3   9  11
l4  13  15

### Selecionando linhas especificas

In [15]:
# A partir da linha(index) 2 ate o fim
df[2:]

    c1  c2  c3  c4
l3   9  10  11  12
l4  13  14  15  16

In [20]:
# Da linha(index) 0 ate linha 2
df[0:2]

    c1  c2  c3  c4
l1   1   2   3   4
l2   5   6   7   8

In [28]:
# Quero apenas da coluna c1 e c4, a linha 1 a 3 
df[1:3][['c1','c4']]

    c1  c4
l2   5   8
l3   9  12

### Selecionar linha especifica

In [32]:
# Selecionar apenas linha 3
df.loc['l3']

c1     9
c2    10
c3    11
c4    12
Name: l3, dtype: int64

In [37]:
# Selecionar apenas linha 1 e 3
df.loc[['l1' , 'l3']]

    c1  c2  c3  c4
l1   1   2   3   4
l3   9  10  11  12

### Selecionando linha e coluna especifica

In [38]:
# Selecionar linha 1 e coluna 2
df.loc['l1' , 'c2']

2

### iloc: Ao inves de selecionar atraves do nome, selecionar atraves do indice

In [39]:
df.iloc[0, 1]

2